출처: https://github.com/minsuk-heo/kaggle-titanic/blob/master/titanic-solution.ipynb 

본인은 이것을 따라서 해보고 거기에서 궁금증 위주로 진행합니다.

## 질문1 

모두 살았다고 하면 몇 점(%)이나 나올까?

In [1]:
## 공통부분 
import pandas as pd

train = pd.read_csv('input/train.csv')
test = pd.read_csv('input/test.csv')

아래에 나와 있듯이 train과 test 모두 null 값이 매우 많습니다.

In [2]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

만약 null(NaN)이 하나라도 있는 행들을 탈락시켜보면 몇개나 남을까요?

In [4]:
#891개 -> 183개만 남음 
train.dropna(axis=0).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
PassengerId    183 non-null int64
Survived       183 non-null int64
Pclass         183 non-null int64
Name           183 non-null object
Sex            183 non-null object
Age            183 non-null float64
SibSp          183 non-null int64
Parch          183 non-null int64
Ticket         183 non-null object
Fare           183 non-null float64
Cabin          183 non-null object
Embarked       183 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 15.0+ KB

In [5]:
#418개 -> 87개만 남음 
test.dropna(axis=0).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 87 entries, 12 to 414
Data columns (total 11 columns):
PassengerId    87 non-null int64
Pclass         87 non-null int64
Name           87 non-null object
Sex            87 non-null object
Age            87 non-null float64
SibSp          87 non-null int64
Parch          87 non-null int64
Ticket         87 non-null object
Fare           87 non-null float64
Cabin          87 non-null object
Embarked       87 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 6.5+ KB

따라서 null 값이 있는 곳도 생존 여부를 추정할 수 있는 방법이 필요합니다.

### 1.1 모두 생존으로 만들기

In [6]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [16]:
## 결과 생성하기 
submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": 1
    })
submission.to_csv('submission_y01.csv', index=False)

In [17]:
submission.head()

   PassengerId  Survived
0          892         1
1          893         1
2          894         1
3          895         1
4          896         1

### 결과는? 0.37320 / 11336 등

## 질문2 : 481 명 모두 죽었다고 하면?

In [18]:
## 결과 생성하기 
submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": 0
    })
submission.to_csv('submission_y02.csv', index=False)

In [19]:
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

### 결과는? 0.62679 / 11096 등 (대략 240등 오름)
이제는 어떻게 해야 하지?

## 질문3: 이제는 재대로 해보자